In [1]:
import mysql.connector 
import pandas as pd

In [2]:
mydb = mysql.connector.connect(host="localhost",user="root",passwd="mysql",database="mydata")

In [9]:
cursor = mydb.cursor()
sql = "select * from shop"

In [10]:
cursor.execute(sql)

In [11]:
df = pd.DataFrame(cursor.fetchall(),columns=['id','name','age'])

In [12]:
df

   id   name  age
0   1  Priya    3
1   1   Juhi   30
2   2   rghi   40
3   3  rgh4i   50

In [14]:
df.groupby(['id']).count()

    name  age
id
1      2    2
2      1    1
3      1    1

In [15]:
cursor = mydb.cursor()
sql = "select distinct id from shop order by id desc limit 1,1"

In [16]:
cursor.execute(sql)

In [17]:
cursor.fetchall()

[(2,)]

In [18]:
df1 = pd.DataFrame({'Key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df2 = pd.DataFrame({'Key': ['a', 'b', 'd'], 'data2': range(3)})

In [19]:
df1d

  Key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [20]:
df2

  Key  data2
0   a      0
1   b      1
2   d      2

In [40]:
k = pd.merge(df1,df2,on='Key',how='right')

In [41]:
k

  Key  data1  data2
0   b    0.0      1
1   b    1.0      1
2   b    6.0      1
3   a    2.0      0
4   a    4.0      0
5   a    5.0      0
6   d    NaN      2

In [30]:
k['avg'] = k.mean(axis=1)

In [31]:
k

  Key  data1  data2  avg
0   b      0      1  0.5
1   b      1      1  1.0
2   b      6      1  3.5
3   a      2      0  1.0
4   a      4      0  2.0
5   a      5      0  2.5

In [67]:
md = {'dn':['D1','D1','D2','D2'],'mn':['M1','M1','M2','M3'],'rt':[3,3,2,4],'country':['US','IND','UK','IND']}
dm = {'mn':['M1','M1','M2'],'ac':['A11','A12','A12'],'rd':[1992,1993,1999]}

In [68]:
d1 = pd.DataFrame(md)
d2 = pd.DataFrame(dm)

In [69]:
d3 = pd.merge(d1,d2)

In [70]:
d3

  country  dn  mn  rt   ac    rd
0      US  D1  M1   3  A11  1992
1      US  D1  M1   3  A12  1993
2     IND  D1  M1   3  A11  1992
3     IND  D1  M1   3  A12  1993
4      UK  D2  M2   2  A12  1999

In [61]:
d3.loc[d3['rt']>=3,'dn'].unique()

array(['D1'], dtype=object)

In [53]:
#Dirrector having movie ratng >=3
#Anctor which has worked with more no of director return actor and director name
#Movie which has released in all country
#movies whose release dates are concurrent like 1992 nd 1993

In [84]:
d3['ac'].value_counts()

A12    3
A11    2
Name: ac, dtype: int64

In [87]:
d3['dn']

0    D1
1    D1
2    D1
3    D1
4    D2
Name: dn, dtype: object